In [1]:
# Dependencies
from sqlalchemy import create_engine
from config import password
import pymysql
pymysql.install_as_MySQLdb()
import pandas as pd

In [2]:
# Create a connection to the database
conn = "root:{0}@localhost:3306/diabetes_db".format(password) # Password is in a separate file
engine = create_engine(f"mysql://{conn}")

In [3]:
# Confirm presence of tables
engine.table_names()

['diabetes', 'location', 'nutrition', 'obesity']

In [4]:
# Read the table contents (for location)
diabetes = pd.read_sql("select * from diabetes", con = engine)

In [5]:
location = pd.read_sql("select * from location", con = engine)

In [6]:
obesity = pd.read_sql("select * from obesity", con = engine)

In [12]:
diabetes.head()

   Year  US_State Adult_Diabetics_%
0  2012      Guam               9.6
1  2012    Alaska                 7
2  2012   Alabama              12.2
3  2012  Arkansas              11.3
4  2012   Arizona              10.6

In [13]:
location.head()

     US_State
0     Alabama
1      Alaska
2     Arizona
3    Arkansas
4  California

In [14]:
obesity.head()

   Year US_State  Obese_Children_%
0  2010  Alabama              15.8
1  2012  Alabama              15.6
2  2014  Alabama              16.3
3  2010   Alaska              21.2
4  2012   Alaska              20.6

In [16]:
#Merging diabetes and obesity
merged = pd.merge(diabetes, obesity, on=['Year','US_State'], how='inner')

In [17]:
merged.head()

   Year  US_State Adult_Diabetics_%  Obese_Children_%
0  2012      Guam               9.6              10.0
1  2012    Alaska                 7              20.6
2  2012   Alabama              12.2              15.6
3  2012  Arkansas              11.3              14.6
4  2012   Arizona              10.6              14.9

In [18]:
merged.to_sql(name = "merged", con = engine, if_exists = "replace", index = False)

In [19]:
pd.read_sql_query("select * from merged", con = engine).head()

   Year  US_State Adult_Diabetics_%  Obese_Children_%
0  2012      Guam               9.6              10.0
1  2012    Alaska                 7              20.6
2  2012   Alabama              12.2              15.6
3  2012  Arkansas              11.3              14.6
4  2012   Arizona              10.6              14.9